_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_16 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_17 (LRN2D)            (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_19 (Dense)             (None, 64)                2768960   
_________________________________________________________________
dense_20 (Dense)             (None, 256)               16640     
_________________________________________________________________
dense_21 (Dense)             (None, 2)                 514       
=================================================================
Total params: 2,788,882
Trainable params: 2,788,882
Non-trainable params: 0
_________________________________________________________________
