_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_18 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_19 (LRN2D)            (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_22 (Dense)             (None, 64)                2768960   
_________________________________________________________________
dense_23 (Dense)             (None, 512)               33280     
_________________________________________________________________
dense_24 (Dense)             (None, 2)                 1026      
=================================================================
Total params: 2,806,034
Trainable params: 2,806,034
Non-trainable params: 0
_________________________________________________________________
