_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_22 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 173056)            0         
_________________________________________________________________
dense_28 (Dense)             (None, 128)               22151296  
_________________________________________________________________
dense_29 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_30 (Dense)             (None, 2)                 258       
=================================================================
Total params: 22,170,834
Trainable params: 22,170,834
Non-trainable params: 0
_________________________________________________________________
