_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_20 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_21 (LRN2D)            (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_25 (Dense)             (None, 128)               5537920   
_________________________________________________________________
dense_26 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_27 (Dense)             (None, 2)                 258       
=================================================================
Total params: 5,557,458
Trainable params: 5,557,458
Non-trainable params: 0
_________________________________________________________________
