_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_1 (LRN2D)             (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_2 (LRN2D)             (None, 52, 52, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 52, 52, 16)        2320      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 26, 26, 16)        0         
_________________________________________________________________
lr_n2d_3 (LRN2D)             (None, 26, 26, 16)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 26, 26, 16)        2320      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 13, 13, 16)        0         
_________________________________________________________________
lr_n2d_4 (LRN2D)             (None, 13, 13, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2704)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                173120    
_________________________________________________________________
dense_2 (Dense)              (None, 128)               8320      
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 258       
=================================================================
Total params: 189,106
Trainable params: 189,106
Non-trainable params: 0
_________________________________________________________________
