_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_14 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_15 (LRN2D)            (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                2768960   
_________________________________________________________________
dense_16 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_17 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 130       
=================================================================
Total params: 2,788,434
Trainable params: 2,788,434
Non-trainable params: 0
_________________________________________________________________
