_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_12 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_13 (LRN2D)            (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 64)                2768960   
_________________________________________________________________
dense_13 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_14 (Dense)             (None, 2)                 258       
=================================================================
Total params: 2,780,306
Trainable params: 2,780,306
Non-trainable params: 0
_________________________________________________________________
