_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_10 (LRN2D)            (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_11 (LRN2D)            (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               5537920   
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 258       
=================================================================
Total params: 5,540,946
Trainable params: 5,540,946
Non-trainable params: 0
_________________________________________________________________
