_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_5 (LRN2D)             (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_6 (LRN2D)             (None, 52, 52, 16)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 52, 52, 16)        2320      
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 26, 26, 16)        0         
_________________________________________________________________
lr_n2d_7 (LRN2D)             (None, 26, 26, 16)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 10816)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                692288    
_________________________________________________________________
dense_5 (Dense)              (None, 128)               8320      
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 258       
=================================================================
Total params: 705,954
Trainable params: 705,954
Non-trainable params: 0
_________________________________________________________________
