_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 208, 208, 16)      448       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 104, 104, 16)      0         
_________________________________________________________________
lr_n2d_8 (LRN2D)             (None, 104, 104, 16)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 104, 104, 16)      2320      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 52, 52, 16)        0         
_________________________________________________________________
lr_n2d_9 (LRN2D)             (None, 52, 52, 16)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 32)                1384480   
_________________________________________________________________
dense_8 (Dense)              (None, 128)               4224      
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 258       
=================================================================
Total params: 1,391,730
Trainable params: 1,391,730
Non-trainable params: 0
_________________________________________________________________
