_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 64, 64, 16)        448       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
lr_n2d_18 (LRN2D)            (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
lr_n2d_19 (LRN2D)            (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_22 (Dense)             (None, 64)                262208    
_________________________________________________________________
dense_23 (Dense)             (None, 512)               33280     
_________________________________________________________________
dense_24 (Dense)             (None, 2)                 1026      
=================================================================
Total params: 299,282
Trainable params: 299,282
Non-trainable params: 0
_________________________________________________________________
