_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 64, 64, 16)        448       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
lr_n2d_10 (LRN2D)            (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
lr_n2d_11 (LRN2D)            (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               524416    
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 258       
=================================================================
Total params: 527,442
Trainable params: 527,442
Non-trainable params: 0
_________________________________________________________________
