_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 64, 64, 16)        448       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
lr_n2d_20 (LRN2D)            (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
lr_n2d_21 (LRN2D)            (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_25 (Dense)             (None, 128)               524416    
_________________________________________________________________
dense_26 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_27 (Dense)             (None, 2)                 258       
=================================================================
Total params: 543,954
Trainable params: 543,954
Non-trainable params: 0
_________________________________________________________________
