_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 64, 64, 16)        448       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
lr_n2d_22 (LRN2D)            (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 16384)             0         
_________________________________________________________________
dense_28 (Dense)             (None, 128)               2097280   
_________________________________________________________________
dense_29 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_30 (Dense)             (None, 2)                 258       
=================================================================
Total params: 2,116,818
Trainable params: 2,116,818
Non-trainable params: 0
_________________________________________________________________
