_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 64, 64, 16)        448       
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
lr_n2d_14 (LRN2D)            (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
lr_n2d_15 (LRN2D)            (None, 16, 16, 16)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                262208    
_________________________________________________________________
dense_16 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_17 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 130       
=================================================================
Total params: 281,682
Trainable params: 281,682
Non-trainable params: 0
_________________________________________________________________
